Revit 2027 API
MEPCurveType.Roughness Property
The roughness of the MEP curve type. For PipeTypes, please use Segment::Roughness
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Roughness { get; set; }
Public Property Roughness As Double
	Get
	Set
public:
property double Roughness {
	double get ();
	void set (double value);
}
member Roughness : float with get, set
Property Value
Double
See Also
Reference
MEPCurveType Class
Autodesk.Revit.DB Namespace